2.2.013/src/Catalogs/МК_ДокументыКЭДО/МК_ДокументыКЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_ДокументыКЭДО</name>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТипаДокумента</name>
    <comment>Код типа документа справочника в МояКоманда</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияСсылка</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутПодписания</name>
    <type>
      <types>EnumRef.МК_МаршрутыПодписания</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.МК_СтатусыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>КрайнийСрокПодписания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученИзМК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаПодписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РуководительФЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецЭЦП</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЧислом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МЧД</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОчередьПодписания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокументаМК</name>
    <type>
      <types>CatalogRef.МК_ВидыДокументовМояКоманда</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МК_КодДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьДоФайлаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийПодписант</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СотрудникиДокумента</name>
    <attributes>
      <name>СотрудникСсылка</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подписанты</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийПодписант</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПодписания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

2.2.013/src/Enums/МК_СтатусыДокументов/МК_СтатусыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МК_СтатусыДокументов</name>
  <enumValues>
    <name>С1</name>
  </enumValues>
  <enumValues>
    <name>С2</name>
  </enumValues>
  <enumValues>
    <name>С3</name>
  </enumValues>
  <enumValues>
    <name>С4</name>
  </enumValues>
  <enumValues>
    <name>С5</name>
  </enumValues>
  <enumValues>
    <name>С6</name>
  </enumValues>
</mdclass:Enum>

2.2.013/src/Catalogs/МК_ДокументыКЭДО/Forms/ФормаСписка/Module.bsl
//&НаКлиенте
//Процедура ПроверитьСтатусыДокументов(Команда)
//	ПроверитьСтатусыНаСервере();   
//	Элементы.Список.Обновить();
//КонецПроцедуры  

//&НаСервере
//Процедура ПроверитьСтатусыНаСервере()   
//	мСписДок = Справочники.МК_ДокументыКЭДО.ПолучитьСписокНезавершенных();
//	мСпис = Справочники.МК_ДокументыКЭДО.ЗапросСтатусовДокументовКЭДО(мСписДок);  	
//	Если мСпис.Количество() >0 Тогда   
//		мКолво = Справочники.МК_ДокументыКЭДО.ЗаполнитьСтатусы(мСпис);
//	КонецЕсли;
//КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьСписокДокументов(Команда)
	мРез = ОбновитьСписокНаСервере();   
	Если мРез.Результат Тогда
		Элементы.Список.Обновить();
	Иначе	  
		ПоказатьПредупреждение(,"Операция не удалась: " + мРез.ТекстОшибки);
	КонецЕсли;	
КонецПроцедуры  

&НаСервере
Функция ОбновитьСписокНаСервере()   
	Возврат Справочники.МК_ДокументыКЭДО.ПолучитьИОбработатьДокументыИзМК(); 
КонецФункции



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Надо определить текущего пользователя, как физлицо
	мПользователь = Пользователи.ТекущийПользователь().ФизическоеЛицо;  
	Если ЗначениеЗаполнено(мПользователь) Тогда
		ЭтотОбъект.Пользователь = мПользователь;
	Иначе
		Сообщить("Внимание! Не указано физическое лицо в справочнике пользователей ЗУП для текущего пользователя. Активные действия будут невозможны.")
	КонецЕсли;	
КонецПроцедуры    

&НаКлиенте
Процедура ОбновитьФильтр(Элемент)
	ПрименятьОрганизациюПриИзмененииНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры


 &НаСервере
Процедура ПрименятьОрганизациюПриИзмененииНаСервере()
	Список.Отбор.Элементы.Очистить();
	мПоказОрг = ЭтаФорма.ПрименятьОрганизацию;		
	мОрг = ЭтаФорма.ОрганизацияФильтр;
	Если мПоказОрг И ЗначениеЗаполнено(мОрг) Тогда       	
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОрганизацияСсылка");
	    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	    ЭлементОтбора.Использование = Истина;
	    ЭлементОтбора.ПравоеЗначение = мОрг; 
	КонецЕсли;	
	мПоказСотр = ЭтаФорма.ПрименятьСотрудника;		
	мСотр = ЭтаФорма.СотрудникФильтр;
	Если мПоказСотр И ЗначениеЗаполнено(мСотр) Тогда       	
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сотрудник");
	    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	    ЭлементОтбора.Использование = Истина;
	    ЭлементОтбора.ПравоеЗначение = мСотр; 
	КонецЕсли;  
	мПоказСтатус = ЭтаФорма.ПрименятьСтатус;		
	мСтатус = ЭтаФорма.СтатусДокументаФильтр;
	Если мПоказСтатус И ЗначениеЗаполнено(мСтатус) Тогда       	
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатусДокумента");
	    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	    ЭлементОтбора.Использование = Истина;
	    ЭлементОтбора.ПравоеЗначение = мСтатус; 
	КонецЕсли;
    мПоказТип = ЭтаФорма.ПрименятьТипДокумента;		
	мТип = ЭтаФорма.ТипДокументаМК;
	Если мПоказТип И ЗначениеЗаполнено(мТип) Тогда       	
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипДокументаМК");
	    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	    ЭлементОтбора.Использование = Истина;
	    ЭлементОтбора.ПравоеЗначение = мТип; 
	КонецЕсли;   
	мПоказДаты = ЭтаФорма.ПрименятьДату;		
	Если мПоказДаты И ЗначениеЗаполнено(ЭтаФорма.ДатаСозданияФильтр) Тогда       	  
		мДата1 = ЭтаФорма.ДатаСозданияФильтр;
		мДата2 = КонецДня(мДата1);

		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаДокумента");
	    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	    ЭлементОтбора.Использование = Истина;
	    ЭлементОтбора.ПравоеЗначение = мДата1;                                               
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаДокумента");
	    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	    ЭлементОтбора.Использование = Истина;
	    ЭлементОтбора.ПравоеЗначение = мДата2;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСотрудниковНаСервере()	
	Выборка = Справочники.МК_ДокументыКЭДО.Выбрать();
	Пока Выборка.Следующий() Цикл  
		мОбъект = Выборка.ПолучитьОбъект();
		Если мОбъект.СотрудникиДокумента.Количество() > 0 Тогда
			мОбъект.Сотрудник = мОбъект.СотрудникиДокумента[0].СотрудникСсылка;
		КонецЕсли;
		мОбъект.ТипДокументаМК = Справочники.МК_ВидыДокументов.НайтиПоРеквизиту("КодВМояКоманда",мОбъект.КодТипаДокумента);
		мОбъект.Записать();
	КонецЦикла;	                                                                	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСотрудников(Команда)
	ЗаполнитьСотрудниковНаСервере();                                            
	Элементы.Список.Обновить();
КонецПроцедуры                                                                  


&НаСервере
Функция ДелегироватьНаСервере1(мЗ)
	// Делегирование — получение списка пользователей
	// GET /api/1c-exchange/edms/documents/delegate/users-list
	мНашел = Ложь;       	
	мПослеТекущего = Ложь;
	мРез = Новый Структура("Результат,ТекстОшибки,СписокДелегатов", Ложь);
	мТЗ = мЗ.Подписанты;
	Для Каждого мСтр Из мТЗ Цикл
		Если мСтр.ТекущийПодписант Или мПослеТекущего Тогда
			мПослеТекущего = Истина;
			мНомерУчастника = мСтр.Номер;			
			Если мСтр.ТипПодписи = "УКЭП" Тогда
				мНашел = Истина; 
				Прервать;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	     
	Если мНашел Тогда
		мРез = Справочники.МК_ДокументыКЭДО.ПолучитьСписокДелегатов(мНомерУчастника);				
	Иначе
		//мРез.ТекстОшибки = "Делегировать можно только подписанта с УКЭП";    
		мРез.ТекстОшибки = "Делегирование доступно только для документов в статусе: ""На подписании"", ""Просрочен"", и еще не подписанных директором";
	КонецЕсли;	
	Возврат мРез;         
КонецФункции


&НаКлиенте
Процедура Делегировать(Команда) 
	мЗ = Элементы.Список.ТекущаяСтрока;	   
	мЗ1 = Элементы.Список.ТекущиеДанные;	   
	Если мЗ1.СтатусДокумента = ПредопределенноеЗначение("Перечисление.МК_СтатусыДокументов.С2") Или 
		  мЗ1.СтатусДокумента = ПредопределенноеЗначение("Перечисление.МК_СтатусыДокументов.С3") Тогда

		мРез = ДелегироватьНаСервере1(Элементы.Список.ТекущаяСтрока); 
		Если мРез.Результат Тогда
			мСпис = мРез.Подписанты;  
			Если мСпис.Количество()>0 Тогда
				мПараметры = Новый Структура("СписокДелегатов,НомерУчастника",мСпис,мРез.НомерУчастника) ; 				
				Оп = Новый ОписаниеОповещения("МК_ВыполнитьПослеОкончания", ЭтотОбъект); 
				ОткрытьФорму("Справочник.МК_ДокументыКЭДО.Форма.ФормаВыбораПодписанта",мПараметры,ЭтаФорма,Истина,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
			Иначе	                                                            
				ПоказатьПредупреждение(,"Список подписантов пуст");
			КонецЕсли;	
		Иначе                       
			ПоказатьПредупреждение(,"Операция не удалась: " + мРез.ТекстОшибки);
		КонецЕсли;	
	Иначе         
		ПоказатьПредупреждение(,"Делегирование доступно только для документов в статусе: ""На подписании"" и ""Просрочен"".");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура МК_ВыполнитьПослеОкончания(мПарам, мДопПарам)      Экспорт 
	Если ЗначениеЗаполнено(мПарам) Тогда 
		мЗ = Элементы.Список.ТекущаяСтрока;
		мРез = ДелегироватьНаСервере2(мПарам,мЗ);	
		Если Не мРез.Результат Тогда  
			ПоказатьПредупреждение(,"Операция не удалась: " + мРез.ТекстОшибки);
		КонецЕсли;
		ОповеститьОбИзменении(мЗ);
	КонецЕсли;	
КонецПроцедуры   

&НаСервере
Функция ДелегироватьНаСервере2(мПарам, мЗ) 
	// Делегирование — отправка назначения
	// POST/api/1c-exchange/edms/documents/delegate	
    мРез = Справочники.МК_ДокументыКЭДО.ОтправитьДелегата(мПарам);  
	Если Не мРез.Подписанты = Неопределено Тогда
		мПарам = Новый Структура("ДокСсылка, Статус, Подписанты",мЗ,мРез.Статус,мРез.Подписанты);
		Справочники.МК_ДокументыКЭДО.ОбновитьДокумент(мПарам);  
	КонецЕсли;	
	Возврат мРез;
КонецФункции

&НаСервере
Функция НапомнитьНаСервере(мЗ)       
	мНашел = Ложь;   
	мРез = Новый Структура("Результат,ТекстОшибки", Ложь);     
	мТЗ = мЗ.Подписанты;
	Для Каждого мСтр Из мТЗ Цикл
		Если мСтр.ТекущийПодписант Тогда
			мНомерУчастника = мСтр.Номер;
			мНашел = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	     
	Если мНашел Тогда
		мПараметры = Новый Структура("НомерУчастника",мНомерУчастника) ; 				
		мРез = Справочники.МК_ДокументыКЭДО.НапомнитьОПодписании(мПараметры); 
		мПарам = Новый Структура("ДокСсылка, Статус, Подписанты",мЗ,мРез.Статус,мРез.Подписанты);
		Справочники.МК_ДокументыКЭДО.ОбновитьДокумент(мПарам);
	Иначе
		Сообщить("Некому напоминать");
	КонецЕсли;		                                   
	Возврат мРез;
КонецФункции

&НаКлиенте
Процедура Напомнить(Команда)    
	мЗ = Элементы.Список.ТекущаяСтрока;		
	мЗ1 = Элементы.Список.ТекущиеДанные;		
	Если НЕ (мЗ1.СтатусДокумента = ПредопределенноеЗначение("Перечисление.МК_СтатусыДокументов.С2") Или 
		  мЗ1.СтатусДокумента = ПредопределенноеЗначение("Перечисление.МК_СтатусыДокументов.С3")) Тогда
		ПоказатьПредупреждение(, "Напоминание в данном статусе документа невозможно");   
	Иначе		
		мРез = НапомнитьНаСервере(мЗ);
		Если мРез.Результат Тогда  
			ПоказатьПредупреждение(,"Напоминание отправлено");  
		Иначе                                                   
			ПоказатьПредупреждение(,мРез.ТекстОшибки);  
		КонецЕсли;	
		ОповеститьОбИзменении(мЗ);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция УдалитьНаСервере(мЗ)   	
	мДок = СокрЛП(мЗ.УникальныйИдентификатор());
	мРез = Справочники.МК_ДокументыКЭДО.УдалитьДокумент(мДок);
	мПарам = Новый Структура("ДокСсылка, Статус, Подписанты",мЗ,мРез.Статус,мРез.Подписанты);
	Справочники.МК_ДокументыКЭДО.ОбновитьДокумент(мПарам);  			
	Возврат мРез;
КонецФункции

&НаКлиенте
Процедура Удалить(Команда) 
	мЗ = Элементы.Список.ТекущиеДанные;		
	Если мЗ.СтатусДокумента = ПредопределенноеЗначение("Перечисление.МК_СтатусыДокументов.С4") Или 
		  мЗ.СтатусДокумента = ПредопределенноеЗначение("Перечисление.МК_СтатусыДокументов.С6") Тогда
		ПоказатьПредупреждение(, "Удаление документа в данном статусе невозможно");   
	Иначе	
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияВопросаУдаления", ЭтотОбъект);
    	ПоказатьВопрос(ОписаниеОповещения, "Вы действительно хотите удалить документ?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаУдаления(мРез, мДопПарам)  Экспорт
	Если мРез = КодВозвратаДиалога.Да Тогда
		мЗ = Элементы.Список.ТекущаяСтрока;	
		//Для документов в статусах “Выполнен” и “Недействителен” нажатие возвращает сообщение об ошибке “Удаление документа в данном статусе невозможно”
		мРез = УдалитьНаСервере(мЗ);
		Если мРез.Результат Тогда
			ПоказатьПредупреждение(,"Удаление выполнено успешно");  	
		Иначе	
			ПоказатьПредупреждение(,мРез.ТекстОшибки);  	
		КонецЕсли;	
		ОповеститьОбИзменении(мЗ);
	КонецЕсли;	
КонецПроцедуры
